src/Documents/ЗаявлениеНаПрименениеЛьготы/ЗаявлениеНаПрименениеЛьготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПрименениеЛьготы</name>
  <comment>(регл)</comment>
  <basedOn>Document.ПриемНаРаботуВОрганизацию</basedOn>
  <registerRecords>InformationRegister.ЛьготыРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиОрганизации</name>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>CatalogRef.ВидыЛьготРаботниковОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛьготыРаботниковОрганизаций/ЛьготыРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготыРаботниковОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Льгота</name>
    <type>
      <types>CatalogRef.ВидыЛьготРаботниковОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВидыЛьготРаботниковОрганизаций/ВидыЛьготРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЛьготРаботниковОрганизаций</name>
  <predefined>
    <items>
      <name>НДФЛ_612в</name>
      <description>(до 31.12.2009) Льгота на троих и больше детей в возрасте до 18 (на каждого ребенка)</description>
    </items>
    <items>
      <name>НДФЛ_613е</name>
      <description>(с 01.01.2010) Льгота на троих и больше детей в возрасте до 18 (на каждого ребенка)</description>
    </items>
    <items>
      <name>НДФЛ_611</name>
      <description>Базовая льгота</description>
    </items>
    <items>
      <name>НДФЛ_16912ВР</name>
      <description>Второй родитель - льгота для лиц, содержащих двоих и более детей до 18 лет</description>
    </items>
    <items>
      <name>НДФЛ_613в</name>
      <description>Льгота для бывших узников концлагерей...</description>
    </items>
    <items>
      <name>НДФЛ_613г</name>
      <description>Льгота для вывезенных во время войны</description>
    </items>
    <items>
      <name>НДФЛ_613а</name>
      <description>Льгота для Героев Украины, Героев Советского Союза...</description>
    </items>
    <items>
      <name>НДФЛ_612э</name>
      <description>Льгота для инвалидов I - II группы в т.ч. детства</description>
    </items>
    <items>
      <name>НДФЛ_613д</name>
      <description>Льгота для лиц, пребывавших на блокадной терироии Ленинграда</description>
    </items>
    <items>
      <name>НДФЛ_16912</name>
      <description>Льгота для лиц, содержащих двоих и более детей до 18 лет</description>
    </items>
    <items>
      <name>НДФЛ_612б</name>
      <description>Льгота для лиц, содержащих ребенка-инвалида I или II групп</description>
    </items>
    <items>
      <name>НДФЛ_612а</name>
      <description>Льгота для одиноких матерей в расчете на каждого ребенка</description>
    </items>
    <items>
      <name>НДФЛ_613б</name>
      <description>Льгота для участников боевых действий во время Второй мировой войны</description>
    </items>
    <items>
      <name>НДФЛ_16913е</name>
      <description>Льгота для участников боевых действий после Второй мировой войны</description>
    </items>
    <items>
      <name>НДФЛ_612д</name>
      <description>Льгота для чернобыльцев</description>
    </items>
    <items>
      <name>НДФЛ_612г</name>
      <description>Льгота лиц, являющихся вдовцем или вдовой</description>
    </items>
    <items>
      <name>НДФЛ_612ж</name>
      <description>Льгота лицам, пол. стипендию за пресл., в т.ч. журналистам</description>
    </items>
    <items>
      <name>НДФЛ_612е</name>
      <description>Льгота учащимся, студентам, аспирантам...</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОтчетностиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерНДФЛ</name>
    <comment>( 1; 1,5; 2 )</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияНДФЛ</name>
    <type>
      <types>EnumRef.СпособыПримененияЛьготРаботников</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктЗаконаНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ЗаявлениеНаПрименениеЛьготы/ObjectModule.bsl
#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой "П6",
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьЗаявления() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ДатаНК = ПроведениеРасчетов.ДатаВводаНК();
	
	//// ВЫВОД ДАННЫХ В ОТЧЕТ
	Выборка = СформироватьЗапросПоДокументу().Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДатаИзменения < ДатаНК Тогда
			Макет = ПолучитьМакет("Заявление");
		Иначе
			Макет = ПолучитьМакет("Заявление2011");
		КонецЕсли;	
		
		ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
		ОбластьШапка1.Параметры.Заполнить(Выборка);
		ТабДокумент.Присоединить(ОбластьШапка1);
	
		ОбластьДРФО = Макет.ПолучитьОбласть("ДРФО");
		ТабДокумент.Присоединить(ОбластьДРФО);
		Счетчик = 1; 
		Пока Счетчик < 11 Цикл
			ОбластьДРФО = Макет.ПолучитьОбласть("КодПоДРФО" + Строка(Счетчик));	
			КодПоДРФО = Сред(Выборка.ФизЛицо.КодпоДРФО, Счетчик, 1);
			Если Номер <> Неопределено Тогда
				ОбластьДРФО.Параметры.Номер = КодПоДРФО;
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьДРФО);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
		Областьшапка2.Параметры.Заполнить(Выборка);
		ТабДокумент.Присоединить(ОбластьШапка2);		
		
		Если Выборка.Актуальность Тогда
			ОбластьЗаявление = Макет.ПолучитьОбласть("ПрименениеЛьготы");
			//Закон про налог с доходов физических лиц
			
			Если Выборка.ДатаИзменения < ДатаНК Тогда
				ОбластьЗаявление.Параметры.Норма = Выборка.Льгота.ПунктЗаконаНДФЛ;
			Иначе
				КодЛьготы = СтрЗаменить(Выборка.Льгота.Код,"ВР","");
				ОбластьЗаявление.Параметры.Норма = КодЛьготы;
			КонецЕсли;
			
			ОбластьЗаявление.Параметры.Дата = Формат(Дата,"Л=uk; ДФ='дд ММММ гггг'");
			ТабДокумент.Присоединить(ОбластьЗаявление);
		Иначе
			ОбластьЗаявление = Макет.ПолучитьОбласть("ОтказОтЛьготы");
			ОбластьЗаявление.Параметры.Месяц =  Формат(Выборка.ДатаИзменения,"Л=uk; ДФ=ММММ");
			ОбластьЗаявление.Параметры.Год2 = Прав(Формат(выборка.ДатаИзменения,"ДФ=гггг"), 1);
			ОбластьЗаявление.Параметры.Год1 = Сред(Формат(выборка.ДатаИзменения,"ДФ=гггг"), 3,1);
			ОбластьЗаявление.Параметры.Дата = Формат(Дата,"Л=uk; ДФ='дд ММММ гггг'");
			ТабДокумент.Присоединить(ОбластьЗаявление);
		КонецЕсли;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	

	
	Возврат ТабДокумент;
	
КонецФункции // 

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если  ИмяМакета = "ПечатьЗаявления" Тогда
		ТабДокумент = ПечатьЗаявления()
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер,ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Заявление на применение (отказ от) налоговой социальной льготы "));

КонецФункции // Печать

#КонецЕсли


Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	Возврат Новый Структура("ПечатьЗаявления","Печать заявления");		
КонецФункции

Функция  СформироватьЗапросПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаявлениеРаботникиОрганизации.Ссылка.Организация	КАК Организация,
	|	ЗаявлениеРаботникиОрганизации.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник				КАК Сотрудник,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|	ЗаявлениеРаботникиОрганизации.Льгота				КАК Льгота,
	|	ЗаявлениеРаботникиОрганизации.ДатаИзменения			КАК ДатаИзменения,
	|	ЗаявлениеРаботникиОрганизации.Актуальность 			КАК Актуальность,
	|	РаботникиОрганизаций.Должность						КАК Должность,
	|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ФизЛицо.Наименование) КАК ФИО	
	|ИЗ
	|	Документ.ЗаявлениеНаПрименениеЛьготы.РаботникиОрганизации КАК ЗаявлениеРаботникиОрганизации
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&МоментВремени) КАК ФИОФизЛиц
	|ПО
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&МоментВремени) КАК РаботникиОрганизаций
	|ПО
	|	ЗаявлениеРаботникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	И ЗаявлениеРаботникиОрганизации.Ссылка.Организация	= РаботникиОрганизаций.Организация
	|ГДЕ
	|	ЗаявлениеРаботникиОрганизации.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявлениеРаботникиОрганизации.Актуальность УБЫВ,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.Наименование
	|";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос;
	
КонецФункции



////////////////////////////////////////////////////////////////////////////
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		Для каждого СтрокаОснования Из Основание.РаботникиОрганизации Цикл
	      СтрокаРаботники = РаботникиОрганизации.Добавить();
		  
		  СтрокаРаботники.Сотрудник     = СтрокаОснования.Сотрудник;
		  СтрокаРаботники.Льгота        = Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_611;
		  СтрокаРаботники.ДатаИзменения = СтрокаОснования.ДатаПриема;
		  СтрокаРаботники.Актуальность  = Истина;
	   КонецЦикла;		
	
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	Для каждого СтрокаРаботники Из РаботникиОрганизации Цикл

		Движение = Движения.ЛьготыРаботниковОрганизаций.Добавить();
		
		Движение.Организация   = Организация;
		Движение.Сотрудник     = СтрокаРаботники.Сотрудник;
		Движение.Льгота        = СтрокаРаботники.Льгота;
		Движение.Период        = СтрокаРаботники.ДатаИзменения;
		Движение.Актуальность  = СтрокаРаботники.Актуальность;

	КонецЦикла;		

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	
КонецПроцедуры
